test-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:cmp="http://www.abc.org/cmpinfo">
    
    <soap:Body>
        <cmp:GetCompanyDetailRequest>
            <cmp:companyId>12345</cmp:companyId>
        </cmp:GetCompanyDetailRequest>
    </soap:Body>
</soap:Envelope>

